app/views/pages/_post.html.erb

      <p class="card-text"><%= post.content.truncate 50 %></p>
      <p class="card-text">Comments: <%= post.comments.count %></p>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 5]]