app/views/posts/_form.html.erb

   <%= form.label :user_id %>
    <%= form.collection_select :user_id, User.all, :id, :name, {prompt: "Select an author"}, {class: "form-control"} %>
---
SELECT "users".* FROM "users"