app/controllers/comments_controller.rb

  def index
    @comments = Comment.all
---
SELECT "comments".* FROM "comments"

  def new
    @comment = Comment.new
    if params[:post_id]
      post = Post.find_by(id: params[:post_id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

  def create
    @comment = Comment.new(comment_params)
    @comment.user_id = current_user.id

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("body", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "Este es un comentario creado por lukas"], ["user_id", 20], ["post_id", 7], ["created_at", "2024-05-27 18:24:37.852953"], ["updated_at", "2024-05-27 18:24:37.852953"]]

    def set_comment
      @comment = Comment.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]