app/controllers/pages_controller.rb

    def viewpost
        @posts = Post.all
---
SELECT "posts".* FROM "posts"

    def viewcomment
        @comments = Comment.all
---
SELECT "comments".* FROM "comments"