app/controllers/posts_controller.rb

	def create
		@post = Post.new(post_params)
		@post.user_id = current_user.id
		if @post.save
---
INSERT INTO "posts" ("title", "content", "published_at", "answers_count", "likes_count", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"